DLC1p6/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    /*inlet
    {
        #include    "$FOAM_CASE/0/include/offshorewindInlet"
    }

    outlet
    {
        type        zeroGradient; 
    }*/
    
    oversetPatch
    {
	type		overset;
    }
    overset
    {
	patchType		overset;
	type		zeroGradient;
    }
    inlet
    {     
        type           fixedValue;
        value	     $internalField;
    }



    outlet
    {
        type inletOutlet;
	inletValue $internalField;
	value $internalField;
    }
    "(stationaryWalls|atmosphere)"
    {
        type        slip;
        value       uniform (0 0 0);
    }
    
    floatingObject
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
