DLC1p6/background/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(inlet|outlet|stationaryWalls|atmosphere)"
	{
		type            calculated;
        	value           uniform 0;
	}
    

    floatingObject
    {
        type nutkWallFunction;	
	Ks uniform 100e-6;
	Cs uniform 0.5;
	value $internalField;
    }
    overset
    {
	patchType	overset;
	type		zeroGradient;
    }
    oversetPatch
    {
	type		overset;
    }
}

// ************************************************************************* //
