DLC1p6/background/system/elementData
// Blade element data
// Divides the blade into N stations. Two stations define a span section (N-1 span sections).
// An integer number of actuator elements will be defined along each span section. 
// 47 nodes (17 elements) for the NREL 15-MW RWT
// axialDistance[m], radius[m], azimuth, chord[m], chordMount[%], twist[deg]
(0.000 2.3877 0.000 5.2000 0.250 1.56E+01)
(0.000 7.1632 0.000 5.2300 0.250 1.54E+01)
(0.000 11.1938 0.000 5.3600 0.250 1.43E+01)
(0.000 16.7142 0.000 5.5400 0.250 1.24E+01)
(0.000 21.4890 0.000 5.6900 0.250 1.04E+01)
(0.000 26.2656 0.000 5.7600 0.250 8.55E+00)
(0.000 31.0407 0.000 5.7000 0.250 7.19E+00)
(0.000 38.2040 0.000 5.4700 0.250 5.93E+00)
(0.000 42.9795 0.000 5.1600 0.250 4.80E+00)
(0.000 47.7550 0.000 4.8800 0.250 3.85E+00)
(0.000 52.5305 0.000 4.6500 0.250 3.08E+00)
(0.000 57.3060 0.000 4.4200 0.250 2.41E+00)
(0.000 62.0815 0.000 4.2070 0.250 1.83E+00)
(0.000 66.8570 0.000 3.8775 0.250 1.30E+00)
(0.000 71.6320 0.000 3.8000 0.250 8.43E-01)
(0.000 76.4080 0.000 3.6200 0.250 4.37E-01)
(0.000 81.1830 0.000 3.4300 0.250 3.97E-02)
(0.000 85.9500 0.000 3.2400 0.250 -4.07E-01)
(0.000 90.7300 0.000 3.0600 0.250 -9.99E-01)
(0.000 95.5000 0.000 2.8800 0.250 -1.62E+00)
(0.000 102.670 0.000 2.6900 0.250 -2.09E+00)
(0.000 107.450 0.000 2.4800 0.250 -2.18E+00)
(0.000 112.200 0.000 2.0500 0.250 -2.10E+00)
(0.000 114.620 0.000 1.8100 0.250 -1.72E+00)
