DLC1p6/background/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../myVars" //Include global variables



    multiphaseStabilizedTurbulence
   {
    	type            multiphaseStabilizedTurbulence;
    	active          yes;

    multiphaseStabilizedTurbulenceCoeffs
    {
        // Optional coefficients
        lambda2         0.05;   // A value of 0 sets the nut correction to 0 
        Cmu             0.09;  // from k-epsilon model
        C               1.50;  // model coefficient from k-omega model
        alpha           1.36;  // 1/Prt
    }
    }



// ************************************************************************* //
